{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ADHD",
    "1": "Amputation",
    "2": "Anxiety Disorders",
    "3": "Aphasia",
    "4": "Apraxia of Speech",
    "5": "Arthritis",
    "6": "Auditory Processing Disorder",
    "7": "Autism Spectrum Disorder",
    "8": "Bipolar Disorder",
    "9": "Blindness",
    "10": "Cataracts",
    "11": "Cerebral Palsy",
    "12": "Color Blindness",
    "13": "Conductive Hearing Loss",
    "14": "Depression",
    "15": "Developmental Delay",
    "16": "Down Syndrome",
    "17": "Dysarthria",
    "18": "Dyscalculia",
    "19": "Dysgraphia",
    "20": "Dyslexia",
    "21": "Eating Disorders",
    "22": "Executive Functioning Deficits",
    "23": "Fragile X Syndrome",
    "24": "Glaucoma",
    "25": "Intellectual Disability",
    "26": "Language Processing Disorder",
    "27": "Low Vision",
    "28": "Macular Degeneration",
    "29": "Mixed Hearing Loss",
    "30": "Mobility Impairments",
    "31": "Multiple Sclerosis",
    "32": "Muscular Dystrophy",
    "33": "Neural Hearing Loss",
    "34": "Noise-Induced Hearing Loss",
    "35": "Nonverbal Learning Disability",
    "36": "OCD",
    "37": "PTSD",
    "38": "Profound Deafness",
    "39": "Retinal Disorders",
    "40": "Schizophrenia",
    "41": "Selective Mutism",
    "42": "Sensorineural Hearing Loss",
    "43": "Specific Learning Disabilities",
    "44": "Spinal Cord Injury",
    "45": "Stuttering",
    "46": "Tinnitus",
    "47": "Tourette Syndrome",
    "48": "Voice Disorders"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ADHD": 0,
    "Amputation": 1,
    "Anxiety Disorders": 2,
    "Aphasia": 3,
    "Apraxia of Speech": 4,
    "Arthritis": 5,
    "Auditory Processing Disorder": 6,
    "Autism Spectrum Disorder": 7,
    "Bipolar Disorder": 8,
    "Blindness": 9,
    "Cataracts": 10,
    "Cerebral Palsy": 11,
    "Color Blindness": 12,
    "Conductive Hearing Loss": 13,
    "Depression": 14,
    "Developmental Delay": 15,
    "Down Syndrome": 16,
    "Dysarthria": 17,
    "Dyscalculia": 18,
    "Dysgraphia": 19,
    "Dyslexia": 20,
    "Eating Disorders": 21,
    "Executive Functioning Deficits": 22,
    "Fragile X Syndrome": 23,
    "Glaucoma": 24,
    "Intellectual Disability": 25,
    "Language Processing Disorder": 26,
    "Low Vision": 27,
    "Macular Degeneration": 28,
    "Mixed Hearing Loss": 29,
    "Mobility Impairments": 30,
    "Multiple Sclerosis": 31,
    "Muscular Dystrophy": 32,
    "Neural Hearing Loss": 33,
    "Noise-Induced Hearing Loss": 34,
    "Nonverbal Learning Disability": 35,
    "OCD": 36,
    "PTSD": 37,
    "Profound Deafness": 38,
    "Retinal Disorders": 39,
    "Schizophrenia": 40,
    "Selective Mutism": 41,
    "Sensorineural Hearing Loss": 42,
    "Specific Learning Disabilities": 43,
    "Spinal Cord Injury": 44,
    "Stuttering": 45,
    "Tinnitus": 46,
    "Tourette Syndrome": 47,
    "Voice Disorders": 48
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
